app/views/layouts/shared/_header.html.erb

        <li>
          <%= link_to "Ntwrk Feed", member_path(User.where(:email => "admin@simvla.com").first, :format => :rss), :class =>  "button radius hide-for-small", :style =>  "color: salmon;" %>
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'admin@simvla.com' LIMIT 1