blog/app/controllers/join_controller.rb

INSERT INTO `users` (`analytics`, `bio`, `color`, `created_at`, `current_sign_in_at`, `current_sign_in_ip`, `email`, `encrypted_password`, `external_domain`, `external_link`, `external_resource`, `first_name`, `is_enabled`, `last_name`, `last_sign_in_at`, `last_sign_in_ip`, `logo`, `remember_created_at`, `reset_password_sent_at`, `reset_password_token`, `sign_in_count`, `skill`, `subdomain`, `twitter`, `typekit`, `updated_at`, `username`) VALUES ('', 'blank', '#0000', '2014-04-01 18:55:16', NULL, NULL, 'fake@fake.com', '$2a$10$TX0mnjTygJge2HBC6kSHYuuk9AFdd7tN5romWBgLAy5xOsDpMGFHO', NULL, NULL, NULL, 'First', 0, 'Last', NULL, NULL, NULL, NULL, NULL, NULL, 0, 'fake', 'fake', NULL, NULL, '2014-04-01 18:55:16', 'fake')
---
  def create
    @user = User.new(params[:user])
    #@user.roles << Role.find_by_alias(:user)
    @user.is_enabled = false
    @user.subdomain = @user.username

    respond_to do |format|
      if @user.save