blog/app/controllers/members_controller.rb

  def edit
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 12 LIMIT 1