blog/app/controllers/projects_controller.rb

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 12 LIMIT 1
---
  def show #display a specific project
    @project = Project.find(params[:id])
    @user = current_user
    @project_creator = @project.user_id
    @project_user = User.find(@project_creator)

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 2 LIMIT 1
---
  def edit#edit the project
    @project = Project.find(params[:id])

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 2 LIMIT 1
---
  def update #update project in db
    project = Project.new(params[:project])
    @project_old = Project.find(params[:id])