app/controllers/members_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 12 LIMIT 1
---
  def edit
    @user = User.find(params[:id])